import { Tag } from 'antd';

export const DocChangeLog = {
    "完整更新日志": [
        <ul>
            <li>2024.12.17 更新测试信息/课件信息/考试经验等内容</li>
            <li>2024.11.22 优化Lab8讲解结构与内容，完成文档内容</li>
            <li>2024.11.21 完成Lab8在线单元测试工具</li>
            <li>2024.11.20 使用新的公共基础组件，并适配后端新架构 <Tag color='red'>Break Change -
                你将需要拉取更新后的测试框架</Tag></li>
            <li>2024.11.19 修正一些Typo；准备测试相关公共基础组件</li>
            <li>2024.11.15 基本完成Lab8文档内容</li>
            <li>2024.11.03 完善Lab8内容，完成大部分功能讲解</li>
            <li>2024.11.01 将较大文件托管于Cloudflare R2对象存储，提供较浙大云盘更流畅的访问体验;启用强制HTTPS</li>
            <li>2024.10.29 调整Lab8文档结构和顺序</li>
            <li>2024.10.28 实现Lab8动手体验组件的前后端开发；补全GNS3 Q&A并修正问题</li>
            <li>2024.10.26 样式与代码优化；添加组件以简化后续文档</li>
            <li>2024.10.24 修正了GNS3安装的版本问题；全局样式优化 <Tag color='red'>Break Change -
                你将需要卸载3.0.0rc1版本</Tag></li>
            <li>2024.10.22 更新VMWare Workstation资源信息，优化布局空间，初始化Lab8文档，支持Algolia
                Search（爬虫完成爬取后搜索效果会更好）
            </li>
            <li>2024.10.16 文件现在直接托管在网站，减少浙大云盘登录步骤，新增组件</li>
            <li>2024.10.15 增加知识解析Tab，调整文件夹结构与路由，Typo修复</li>
            <li>2024.10.14 更新课件与时间，优化进度展示，上线GNS3功能与设备介绍</li>
            <li>2024.10.12 完成测试框架配置与使用文档</li>
            <li>2024.10.10 完成Lab7实验讲解文档，实现Lab7单元测试页面与工具</li>
            <li>2024.10.09 增加协议设计讲解与功能实现讲解</li>
            <li>2024.10.07 上线部分Lab7 实验讲解，首页支持响应式布局，优化移动端阅读体验</li>
            <li>2024.10.03 上线Angular Commit 信息规范</li>
            <li>2024.10.02
                上线Lab5实验报告模板，增加术语缩写wiki页面跳转，优化IOS指令介绍格式，实验页添加课件资源，上线Lab3-6实验指导，上线Lab7-8工具配置指导
            </li>
            <li>2024.10.01 修正Lab2内容，上线Lab5以外全部实验报告模板</li>
            <li>2024.09.19 上线Lab2实验指导，更新实验报告模板资源，上线IOS指令介绍</li>
            <li>2024.09.18 更新Chap2/Lab7实验指导</li>
            <li>2024.09.14 更新链接/文件卡片样式，减少对正文阅读干扰</li>
            <li>2024.09.13 上线GNS3完整配置教程</li>
            <li>2024.09.10 上线Lab1实验指导，对HTTP抓包部分进行更新，并更新实验报告模板资源</li>
            <li>2024.09.07 完成Wireshark使用文档，更新安装文档格式，使用CDN加速网页访问（感谢CloudFlare的免费套餐）</li>
            <li>2024.09.06 上线页面，完成Wireshark安装文档，完成GNS3客户端安装文档，完成术语翻译页面，基本完成首页信息展示
            </li>
        </ul>
    ]
}

export const NoteChangeLog = {
    "完整更新日志": [
        <ul>
            <li>2024.12.23 添加全部章节页面</li>
            <li>2024.11.12 完成CIDR分组匹配转发模拟</li>
            <li>2024.11.09 完成CIDR子网划分计算器</li>
            <li>2024.10.18 完成TCP拥塞控制可视化</li>
            <li>2024.10.17 添加不可变参版本的TCP拥塞控制可视化</li>
            <li>2024.10.15 初始化文档</li>
        </ul>
    ]
}
