export const LabDeadlineData = [
    { name: 'Lab 1', start: '2025-09-16 18:50:00', end: '2025-09-30 23:59:59', },
    { name: 'Lab 2', start: '2025-10-07 18:50:00', end: '2025-10-21 23:59:59', },
    { name: 'Lab 3', start: '2025-10-21 18:50:00', end: '2025-11-04 23:59:59', },
    { name: 'Lab 4', start: '2025-11-04 18:50:00', end: '2025-11-18 23:59:59', },
    { name: 'Lab 5', start: '2025-11-18 18:50:00', end: '2025-12-02 23:59:59', },
    { name: 'Lab 6', start: '2025-12-02 18:50:00', end: '2025-12-16 23:59:59', },
    { name: 'Lab 7', start: '2025-09-23 18:50:00', end: '2025-12-28 23:59:59', },
    { name: 'Lab 8', start: '2025-09-23 18:50:00', end: '2025-12-28 23:59:59', },
];

const courseWorkData = {
    items: [
        { key: 0, name: '课程作业', cnt: 6, ratio: '15%' },
        { key: 1, name: '课堂测验', cnt: 8, ratio: '10%' },
        { key: 2, name: '课程实验', cnt: 8, ratio: '25%' },
        { key: 3, name: '期末考试', cnt: 1, ratio: '50%' },
    ],
    detail: [
        [
            { name: 'Homework 1', start: '2025-09-16 12:00:00', end: '2025-09-26 23:59:00', },
            { name: 'Homework 2', start: '2025-09-23 12:00:00', end: '2025-10-07 23:59:00', },
            { name: 'Homework 3', start: '2025-10-07 12:00:00', end: '2025-10-22 23:59:00', },
            { name: 'Homework 4', start: '2025-10-21 12:00:00', end: '2025-11-03 23:59:00', },
            { name: 'Homework 5', start: '2025-11-04 12:00:00', end: '2025-11-17 23:59:00', },
            { name: 'Homework 6', start: '2025-11-18 12:00:00', end: '2025-12-01 23:59:00', }
        ], [
            { name: 'Quiz 1', start: '2025-12-10 14:40:00', end: '2025-12-10 15:00:00', },
            { name: 'Quiz 2', start: '2025-12-10 15:00:00', end: '2025-12-10 15:20:00', },
            { name: 'Quiz 3', start: '2025-12-17 14:05:00', end: '2025-12-17 14:25:00', },
            { name: 'Quiz 4', start: '2025-12-17 14:25:00', end: '2025-12-17 14:45:00', },
            { name: 'Quiz 5', start: '2025-12-17 14:45:00', end: '2025-12-17 15:05:00', },
            { name: 'Quiz 6', start: '2025-12-24 14:10:00', end: '2025-12-24 14:20:00', },
            { name: 'Quiz 7', start: '2025-12-24 14:20:00', end: '2025-12-24 14:40:00', },
            { name: 'Quiz 8', start: '2025-12-24 14:40:00', end: '2025-12-24 15:00:00', }
        ], LabDeadlineData, [
            { name: '期末考试', start: '2026-01-16 10:30:00', end: '2026-01-16 12:30:00', },
        ]
    ]
}
export default courseWorkData;
